Revit 2026 API

# ScheduleDefinitionAddFilter Method

---

Adds a new filter at the end of the list.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddFilter(
	ScheduleFilter filter
)
```
```vb
Public Sub AddFilter (
	filter As ScheduleFilter
)
```
```cpp
public:
void AddFilter(
	ScheduleFilter^ filter
)
```
```fsharp
member AddFilter :
        filter : ScheduleFilter -> unit
```

#### Parameters

filter ScheduleFilter
     The filter to add.

| Exception | Condition |
| --- | --- |
| ArgumentException | The field ID is not the ID of a field in this ScheduleDefinition. -or- The field and filter type cannot be used to filter this ScheduleDefinition. -or- The filter value is not valid for the field and filter type. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | This ScheduleDefinition does not support filters. -or- The resulting filter count would be greater than 8. |

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace